{
  "Avatar": {
    "alt": "Avatar"
  },

  "ExperienceCard": { "remote": "Remote" },

  "HeaderContent": {
    "title": "Giovanni",
    "subtitle": "Web Developer"
  },

  "LangButton": {
    "fr": "Fr",
    "en": "En"
  },

  "pages": {
    "AboutPage": {
      "title": "About my CV",
      "txt1": "I designed this online CV to provide a concrete overview of the technologies I use and my working methodology: a mobile-first responsive site conceived from the ground up to adapt to all screen sizes. Every design choice—from colors and typography to icons—was crafted entirely by me.",
      "txt2": "To facilitate mobile navigation, I implemented a floating menu at the bottom of the screen, easily accessible by thumb, with the option to position it on the left or right according to your preference (handy for left-handed users!).",
      "txt3": "You can view the full code on my ",
      "txt4": "Also find my projects and experiments on my ",
      "txt5": "And for any contact or collaboration, my profile ",
      "txt6": " is the best channel.",
      "txt7": "Feel free to send me a message there—I’d be delighted to connect with you!"
    },

    "HomePage": {
      "intro": "Full Stack Developer, I began my career by taking charge of web integration within backend-focused teams. This experience allowed me to develop strong expertise in HTML, CSS, JavaScript, and responsive design. After serving as lead integrator, I expanded my skills to front-end and then full-stack development, enabling me to work across the entire development pipeline today. Self-taught and curious, I don’t hesitate to step out of my comfort zone and learn new technologies to meet the challenges entrusted to me.",
      "noContact": "To reduce spam, my email address isn’t displayed directly on the site. However, you can reveal it by printing this page, or contact me via ",
      "experienceTitle": "Professional Experience",

      "experiences": {
        "common": {
          "today": "Today"
        },

        "freelance-2025": {
          "jobTitle": "Freelance",
          "details": "Completion of various front-end tasks for diverse clients"
        },

        "kehops": {
          "jobTitle": "Full Stack Developer",
          "details1": "Complete implementation of the static Kehops website: installation and configuration of the Astro framework, setup of a multi-language translation system, design and integration of all custom styles and animations in HTML/CSS/JavaScript without third-party libraries, and automated deployment to production via a GitHub Action.",
          "details2": "For the Kehops solution—a recruitment assistance software centralizing agencies and fostering competition—I implemented the design using Tailwind CSS, created reusable React components, developed and unit-tested backend use cases, orchestrated GraphQL queries, and built an asynchronous messaging module from scratch to enable user conversations."
        },

        "appcom": {
          "jobTitle": "Front-end Developer",
          "details1": "Developed CommonGrounds, a meeting room reservation platform deployed across multiple companies, where I designed reusable components and customized styles and features to each client's requirements.",
          "details2": "Built the Appcom website on a PHP architecture, coding entirely in HTML, CSS, and vanilla JavaScript without using any libraries.",
          "details3": "Developed Flexy, a teleworking presence management platform that provides real-time visibility into which employees are in the office and which are remote."
        },

        "radioCan": {
          "jobTitle": "Front-end Developer",
          "details1": "Led the React-based redesign of Scoop, the internal CMS for journalists, by creating and documenting components with Storybook and ensuring stability through visual regression tests using Loki."
        },

        "misterFly": {
          "jobTitle": "Front-end Developer",
          "details1": "Executed a responsive redesign of the Idiliz site on an Angular foundation, crafting the entire interface in native HTML and CSS.",
          "details2": "Developed the responsive interface of the Ooofly site on Angular using pure HTML and CSS."
        },

        "bazarchic": {
          "jobTitle": "UI Developer",
          "details1": "As Lead UI Developer, I established and advanced the design system, performed code reviews, and delegated tasks across my two team members.",
          "details2": "Provided strategic consulting on design decisions and user access flows.",
          "details3": "Executed a responsive redesign of the interface.",
          "details4": "Integrated responsive email templates for marketing campaigns."
        },

        "shiva": {
          "jobTitle": "UI Developer",
          "details1": "Developed commercial showcase websites for various clients."
        },

        "bnp": {
          "jobTitle": "UI Developer",
          "details1": "Performed a responsive redesign of the client platform's interface.",
          "details2": "Implemented a design system."
        },

        "weka": {
          "jobTitle": "UI Developer",
          "details1": "Redesigned the responsive interface."
        },

        "kalidea": {
          "jobTitle": "UI Developer",
          "details1": "Designed commercial websites in collaboration with the marketing team.",
          "details2": "Integrated e-commerce modules and configured a custom back-office."
        }
      },

      "educationTitle": "Education",
      "education": {
        "ipssi": {
          "jobTitle": "Master’s Degree in Project Management for Development"
        },
        "julesFerry": {
          "jobTitle": "BTS in IT Management"
        }
      }
    }
  },

  "common": {
    "month_one": "{{count}} month",
    "month_other": "{{count}} months",
    "year_one": "{{count}} year",
    "year_other": "{{count}} years"
  }
}
