{
  "Avatar": {
    "alt": "Avatar"
  },

  "HeaderContent": {
    "title": "Giovanni",
    "subtitle": "Développeur Web"
  },

  "LangButton": {
    "fr": "Fr",
    "en": "En"
  },

  "pages": {
    "AboutPage": {
      "title": "À propos de mon CV",
      "txt1": "J’ai conçu ce CV en ligne pour vous offrir un aperçu concret des technologies que j’utilise et de ma méthodologie de travail : un site responsive mobile-first, pensé dès l’origine pour s’adapter à toutes les tailles d’écran. Chaque choix de design – des couleurs aux typographies en passant par les icônes – a été réalisé de A à Z par mes soins.",
      "txt2": "Pour faciliter la navigation sur mobile, j’ai implémenté un menu flottant positionné en bas de l’écran, facilement accessible au pouce, avec la possibilité de le placer à gauche ou à droite selon votre préférence (pratique si vous êtes gaucher !).",
      "txt3": "Vous pouvez consulter l’intégralité du code sur mon ",
      "txt4": "Retrouvez également mes projets et expérimentations sur mon ",
      "txt5": "Et pour toute prise de contact ou collaboration, mon profil ",
      "txt6": " est le meilleur canal.",
      "txt7": " N’hésitez pas à m’y envoyer un message, je serai ravi d’échanger avec vous !"
    },

    "HomePage": {
      "intro": "Développeur Full Stack, j’ai commencé ma carrière en prenant en main l’intégration web au sein d’équipes centrées sur le back-end. Cette expérience m’a permis de développer une expertise solide en HTML, CSS, JavaScript et design responsive. Après avoir été lead intégrateur, j’ai élargi mes compétences au développement front-end puis full-stack, ce qui me permet aujourd’hui d’intervenir sur l’ensemble de la chaîne de développement. Autodidacte et curieux, je n’hésite pas à sortir de ma zone de confort et à apprendre de nouvelles technologies pour relever les défis qui me sont confiés.",
      "experienceTitle": "Expériences professionnelles",

      "experiences": {
        "kehops": {
          "jobTitle": "Développeur Full Stack",
          "details1": "Réalisation complète du site statique Kehops, installation et configuration du framework Astro, mise en place d’un système de traduction multi-langues, conception et intégration de tous les styles et animations en HTML/CSS/JavaScript sans bibliothèque tierce, et automatisation du déploiement en production via une GitHub Action.",
          "details2": "Pour la solution Kehops — un logiciel d’aide au recrutement centralisant les agences et favorisant la concurrence — j’ai intégré le design avec Tailwind CSS, développé des composants React réutilisables, implémenté les use case backend, rédigé des tests unitaires, orchestré les requêtes GraphQL, puis conçu de A à Z un module de messagerie asynchrone offrant aux utilisateurs un échange de messages."
        },

        "appcom": {
          "jobTitle": "Développeur Front-end",
          "details1": "Développement de CommonGrounds une plateforme de réservation de salles pour meetings, déclinée auprès de plusieurs entreprises, où j’ai conçu des composants réutilisables et adapté styles et fonctionnalités aux besoins spécifiques de chaque client.",
          "details2": "Développement du site d'Appcom sur une architecture PHP, en codant intégralement en HTML, CSS et JavaScript natif, sans recourir à aucune librairie.",
          "details3": "Développement de Flexy, une plateforme de gestion des présences des employés en télétravail, offrant une visibilité instantanée sur qui est au bureau et qui travaille à distance."
        },

        "radioCan": {
          "jobTitle": "Développeur Front-end",
          "details1": "Refonte en React de Scoop, le CMS des journalistes, en créant et documentant mes composants avec Storybook et en garantissant leur stabilité grâce à des tests de régression visuels avec Loki."
        },

        "misterFly": {
          "jobTitle": "Développeur Front-end",
          "details1": "Refonte de Idiliz en responsive sur une base Angular, en réalisant l’interface entièrement en HTML et CSS natifs.",
          "details2": "Développement de l’interface responsive du site Ooofly sur une base Angular en HTML et CSS natifs."
        },

        "bazarchic": {
          "jobTitle": "Développeur UI",
          "details1": "Lead développeur UI, j’ai mis en place et fait évoluer le design system, réalisé les revues de code et réparti les tâches dans mon équipe.",
          "details2": "Conseil stratégique sur les choix de design et accès utilisateurs.",
          "details3": "Refonte responsive de l’interface.",
          "details4": "Intégration d’e-mails responsives pour les campagnes marketing."
        },

        "shiva": {
          "jobTitle": "Développeur UI",
          "details1": "Création de sites vitrines commerciaux pour divers clients."
        },

        "bnp": {
          "jobTitle": "Développeur UI",
          "details1": "Refonte responsive de l’interface de la plateforme client.",
          "details2": "Mise en place d’un design system."
        },

        "weka": {
          "jobTitle": "Développeur UI",
          "details1": "Refonte de l’interface responsive."
        },

        "kalidea": {
          "jobTitle": "Développeur UI",
          "details1": "Conception de sites commerciaux en collaboration avec l’équipe marketing.",
          "details2": "Intégration de modules e-commerce et configuration du back-office personnalisé."
        }
      },

      "educationTitle": "Formations",
      "education": {
        "ipssi": {
          "jobTitle": "Master Chef de projet en développement"
        },
        "julesFerry": {
          "jobTitle": "BTS Informatique de Gestion"
        }
      }
    }
  },

  "common": {
    "month_one": "{{count}} mois",
    "month_other": "{{count}} mois",
    "year_one": "{{count}} an",
    "year_other": "{{count}} ans"
  }
}
